# dropna()

In [1]:
import seaborn as sns

In [18]:
data = sns.load_dataset('titanic')

In [19]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
data.shape

(891, 15)

In [7]:
#data.dropna().shape           # isme sab rows ko drop krdega jis row m bhi null dikhega.

data.dropna(how='all').shape   # isme sirf un rows ko drop karega jo sab columns m null honge.

(891, 15)

In [11]:
# data.dropna(axis=1).shape        # jis column m bhi null value hogi ye delete krdega.

data.dropna(axis=1, how='all').shape   # ye tabhi delete karega agr sab column m koi null value hogi.

(891, 15)

In [14]:
data.dropna(subset=['embarked']).shape  # sirf 2 aysi values hn jahan pr embarked column ki value missing h

(889, 15)

In [16]:
data.dropna(subset=['deck','embarked']).shape   # to ye OR operation ho gaya ke agr in dono m se kisi bhi column m missing value h to delete kr denge.

(201, 15)

# Fillna()

In [22]:
data['embarked'].fillna('Not Specified', inplace=True)

In [25]:
data['age'].fillna(30)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [28]:
data['age'].fillna(method='ffill')  # backfill and forwardfill

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64